{
  "name": "Character Sheet",
  "folder": null,
  "flags": {},
  "pages": [
    {
      "name": "Top Row: Basic Character Data",
      "type": "text",
      "title": {
        "show": true,
        "level": 1
      },
      "text": {
        "format": 1,
        "content": "<p>Should be self explanatory.  The sheet does not enforce XP and level matching.</p>",
        "markdown": ""
      },
      "_id": "bVhdXEqO02zeYwrj",
      "image": {},
      "video": {
        "controls": true,
        "volume": 0.5
      },
      "src": null,
      "system": {},
      "sort": 0,
      "ownership": {
        "default": -1
      },
      "flags": {},
      "_stats": {
        "systemId": "dnd4e",
        "systemVersion": "0.4.9",
        "coreVersion": "13.348",
        "createdTime": null,
        "modifiedTime": 1688154507347,
        "lastModifiedBy": "dnd4ebuilder0000",
        "duplicateSource": null,
        "exportSource": null
      },
      "category": null,
      "_key": "!journal.pages!PuJCVdkeDHbyFpeT.bVhdXEqO02zeYwrj"
    },
    {
      "sort": 100000,
      "name": "Row 2: Hits, Defences and Healing",
      "type": "text",
      "_id": "oATQbXQjvRSU78aN",
      "title": {
        "show": true,
        "level": 1
      },
      "image": {},
      "text": {
        "format": 1,
        "content": "<img style=\"width:100%;height:auto\" src=\"systems/dnd4e/icons/manual-images/hp-defences-healing.jpg\" width=\"848\" height=\"108\" /><p>Click the portrait to change it.</p><h2>Hit Points</h2><p>Instead of manually inputting your total hit points, you can click the Hit Points title and it will bring up a dialog to auto-calculate your hit points based on your class.</p><p>Auto-HP calculation can also be done using effects, which have been configured for all the classes in the SRD Classes Compendium. If you drag and drop such a feature into your character sheet, it will sort out hit points for you.</p><ul><li><p><strong>Example:</strong> @UUID[Compendium.dnd4e.featuresPack.Item.Wcn3QrxgUIQGwteG]{Fighter Class} is used on @UUID[Compendium.dnd4e.example_character.Actor.iK3UnA8rC1xbJ1Ap]{Steve}, which sets the base HP for a Fighter. A further modification from the @UUID[Compendium.dnd4e.featuresPack.Item.w6kVSNawY1wiqRr9]{Tough} feat grants an additional 5 HP per character tier level.</p></li></ul><h2 data-anchor=\"defenses\">Defenses</h2><p>The sheet performs a fair amount of auto-calculation to help you:</p><ul><li>AC is auto calculated based on the armour you are wearing and the relevant ability modifier (if applicable). Only the best armour applies and it must be set as equipped.</li><li>Other defenses are auto calculated based on equipment + relevant ability modifier.</li></ul><p>If you click on the number for AC or defence, you can change the ability that is used to add to that defence, and you can add additional bonuses.</p><p>You can also specify effects to add bonuses that are attached to feats and features.</p><ul><li><p><strong>Example:</strong> @UUID[Compendium.dnd4e.featuresPack.Item.Wcn3QrxgUIQGwteG]{Fighter Class} is used on @UUID[Compendium.dnd4e.example_character.Actor.iK3UnA8rC1xbJ1Ap]{Steve}, and shows how to add the fighter's +2 bonus to Fortitude.</p></li></ul><h2 data-anchor=\"healing-surges\">Healing Surges</h2><p>Surge Value is auto-calculated based on your Max HP.</p><ul><li><p><strong>Example:</strong> @UUID[Compendium.dnd4e.featuresPack.Item.bOLHzqqC3HyXMmBq]{Dragonborn} has an example of an effect that gives a bonus to this number</p></li></ul><p>Surges per day can be entered manually, or you can specify it with an effect.</p><ul><li><p><strong>Example:</strong> @UUID[Compendium.dnd4e.featuresPack.Item.Wcn3QrxgUIQGwteG]{Fighter Class} is used on @UUID[Compendium.dnd4e.example_character.Actor.iK3UnA8rC1xbJ1Ap]{Steve}, and shows how to set the max surge value.</p></li></ul><p>Clicking on the heading under the number lets you specify bonuses to these values without using effects.</p><h3 data-anchor=\"resting-and-healing\">Resting and Healing</h3><p>S. Rest and X. Rest bring up options for your character taking a short or extended rest. These will automatically process rules for these rests:</p><ul><li><p>Short rests will refresh encounter powers, second wind</p></li><li><p>Extended rests will refresh all powers and return hit points and surges etc...</p></li></ul><p>Second Wind applies the effects of the second wind action in combat - e.g. spending a healing surge and regaining HP and pops a message to the chat about its effects so you can remember that you have a round of bonus defences. The SW checkbox is to indicate when you have used second wind for that encounter.</p><p>Heal brings up a generic healing dialog that should easily let you resolve most healing powers.</p><h2 data-anchor=\"action-points\">Action Points</h2><p>Lets you track your action point spend and milestones. You'll get a little chat message when you spend one and it checks the box.</p><p>The Action Point Riders box lets you specify extra text that is output with the Action Point to chat. There is no automation there, but it lets you record things like Warlord / Paragon path bonuses to your AP spend.</p>",
        "markdown": ""
      },
      "video": {
        "controls": true,
        "volume": 0.5
      },
      "src": null,
      "system": {},
      "ownership": {
        "default": -1
      },
      "flags": {},
      "_stats": {
        "systemId": "dnd4e",
        "systemVersion": "0.4.24",
        "coreVersion": "13.348",
        "createdTime": 1688154233688,
        "modifiedTime": 1733179322845,
        "lastModifiedBy": "dnd4ebuilder0000",
        "duplicateSource": null,
        "exportSource": null
      },
      "category": null,
      "_key": "!journal.pages!PuJCVdkeDHbyFpeT.oATQbXQjvRSU78aN"
    },
    {
      "sort": 200000,
      "name": "Row 3: Abilities, Saving Throws, Passives, Speed and Initiative",
      "type": "text",
      "_id": "J2J0J8YONNCa19oi",
      "title": {
        "show": true,
        "level": 1
      },
      "image": {},
      "text": {
        "format": 1,
        "content": "<img style=\"width:100%;height:auto\" src=\"systems/dnd4e/icons/manual-images/abilities-saving-throws-misc.jpg\" width=\"790\" height=\"192\" /><h2 data-anchor=\"abilities\">Abilities</h2><ul><li><p>Click the number to edit it. The modifier (and mod + half level) will be calculated automatically.</p></li><li><p>Click the ability name to make a check for that ability.</p></li></ul><h2 data-anchor=\"saving-throws\">Saving Throws</h2><ul><li><p>Click \"Saving Throw\" or \"Death\" to add a bonus to your regular save or death save.</p></li><li><p>Click the dice icon to roll either save.</p></li></ul><p>The Death save keeps track of your failed death saves.</p><h2 data-anchor=\"passives\">Passives</h2><p>You can specify a bonus to passive perception/insight by clicking on the value.</p><h2 data-anchor=\"speed-and-initiative\">Speed and Initiative</h2><p>You can click either \"Speed\" or the value to bring up a dialog with the different movement speeds. You can manually adjust the value itself, and if you click on the \"bonus\" text you can apply bonuses and penalties. Mouse-hovering over the either the \"Speed value\" or \"Speed button\" will reveal a tooltip that indicates all of a character's calculated speed values for common movement actions they can take.</p><p>You can also specify speeds with effects.</p><p><strong>Examples:</strong></p><ul><li><p>@UUID[Compendium.dnd4e.featuresPack.Item.nwbpWXs919OzW74W]{Dwarf} shows how to set a base speed. There is no elegant way to automatically apply the dwarf's racial trait of not being slowed by armour, so we would suggest that you instead tweak the speed formula to not include the armour penalty.</p></li><li><p>@UUID[Compendium.dnd4e.featuresPack.Item.X9hFYPrJ3GF9SmHS]{Run Faster} is used on @UUID[Compendium.dnd4e.example_character.Actor.iK3UnA8rC1xbJ1Ap]{Steve} and shows how to add bonuses to certain movement modes.</p></li></ul><p>Clicking on the Initiative Value will bring up a dialog to configure initiative bonuses, and choose which Ability Mod is used in association with the roll. By default, this is set to Dexterity.</p><p>By clicking on \"Initiative\" while there is currently an active encounter, you will roll initiative and your character will be added to the Combat Tracker. You may also notice that a decimal value is added to your Initiative Roll. This is equal to 1/100th of your Initiative bonus, and is used as a quick way to resolve ties in the Initiative Roll results.</p>",
        "markdown": ""
      },
      "video": {
        "controls": true,
        "volume": 0.5
      },
      "src": null,
      "system": {},
      "ownership": {
        "default": -1
      },
      "flags": {},
      "_stats": {
        "systemId": "dnd4e",
        "systemVersion": "0.4.24",
        "coreVersion": "13.348",
        "createdTime": 1688154281261,
        "modifiedTime": 1733179355240,
        "lastModifiedBy": "dnd4ebuilder0000",
        "duplicateSource": null,
        "exportSource": null
      },
      "category": null,
      "_key": "!journal.pages!PuJCVdkeDHbyFpeT.J2J0J8YONNCa19oi"
    },
    {
      "sort": 300000,
      "name": "Skills",
      "type": "text",
      "_id": "IWNCVyLdjs8aVQVz",
      "title": {
        "show": true,
        "level": 1
      },
      "image": {},
      "text": {
        "format": 1,
        "content": "<ul><li><p>Click the circle to set that skill as trained</p></li><li><p>Click the circle again if you have the skill focus feat for that skill (you will see a double tick)</p></li><li><p>Right Clicking the check marks will revert them to the previous training levels.</p></li><li><p>Click the skill's name to roll a skill check</p></li><li><p>Click the skill value to add a manual bonus.</p></li><li><p>Skills can also get bonuses from effects.</p><ul><li><p>@UUID[Compendium.dnd4e.featuresPack.Item.NAIdYGuARc0asb9g]{Tiefling} is used on @UUID[Compendium.dnd4e.example_character.Actor.iK3UnA8rC1xbJ1Ap]{Steve} and shows how to add skill bonuses.</p></li></ul></li></ul><p>At the bottom of the skill list, you will see a button labeled \"Edit Skill &amp; Ability Custom Descriptions.\" Clicking this will open up a window where you may edit what the default flavor text is for your Ability and Skill rolls. The default text is \"<code>@name uses @label.</code>\", where <code>@name</code> is replaced by the name of your character, and<code> @label</code> is replaced by the name of the corresponding Ability or Skill.</p>",
        "markdown": ""
      },
      "video": {
        "controls": true,
        "volume": 0.5
      },
      "src": null,
      "system": {},
      "ownership": {
        "default": -1
      },
      "flags": {},
      "_stats": {
        "systemId": "dnd4e",
        "systemVersion": "0.4.24",
        "coreVersion": "13.351",
        "createdTime": 1688154304684,
        "modifiedTime": 1771988469520,
        "lastModifiedBy": "dnd4ebuilder0000",
        "duplicateSource": null,
        "exportSource": null
      },
      "category": null,
      "_key": "!journal.pages!PuJCVdkeDHbyFpeT.IWNCVyLdjs8aVQVz"
    },
    {
      "sort": 400000,
      "name": "Bottom right: Character stuff tabs",
      "type": "text",
      "_id": "eGf9NelTL4ZKA7yE",
      "title": {
        "show": true,
        "level": 1
      },
      "image": {},
      "text": {
        "format": 1,
        "content": "<h2>Biography</h2><p>This is a rich text area you can use to add whatever info you want about the character.</p><h2 data-anchor=\"details-aka-misc-character-information\">Details (aka misc character information)</h2><p>This tab contains a combination of miscellaneous traits and biographical information. Most entries here have no mechanical effect, but there are some notable exceptions.</p><p><strong>Resource 1, 2 &amp; 3:</strong> These allow you to track resources that might be important to your character, but aren't provided for elsewhere in the game—for example, you might use them to track a class resource which needs to be shared between multiple powers, like Channel Divinity. When @UUID[.mVgzXSGDBKE0gtBt]{Creating Powers} you can set them to use one of these resources.</p><p>The \"SR\" and \"LR\" checkboxes for each resource determines if it is refreshed on a short or extended rest respectively.</p><p><strong>Size:</strong> This is used to set the appropriate size for your token.</p><p><strong>Type, Origin &amp; Subtype:</strong> These have no inherent effect, but can be referenced by certain plugins to enhance automation.</p><p><strong>Proficiencies, Languages &amp; Senses:</strong> These have no mechanical effect at the current time.<br /><em><strong>Note:</strong></em> This means that regardless of what proficiencies you set here, the character will not be considered proficient with their equipped weapon or armour unless the \"proficient\" checkbox is set in that item's details.</p><h2 data-anchor=\"powers\">Powers</h2><p>This tab lists all the powers attached to the character, colour-coded according to 4e convention. You can choose how they should be grouped and sorted using the drop-down boxes at the top of the tab. You can also use the \"filter\" field to filter powers by name.</p><p>You can add new powers by using the \"+ Add\" button at the far end of each section header, by dragging and dropping powers from a sidebar or compendium, or by importing them using the button at the top of this tab.</p><ul><li><p><strong>Icon:</strong> Click a power's icon to send it to chat as a rollable power card</p></li><li><p><strong>Name:</strong> Click on a power's name to expand/collapse its details</p></li><li><p><strong>Buttons:</strong> Use the edit and delete buttons at the end of the row to manage powers.</p></li></ul><p>For details on how to set up individual powers, see @UUID[.mVgzXSGDBKE0gtBt]{Creating Powers}.</p><h2 data-anchor=\"inventory\">Inventory</h2><p>This tab is important enough to get its own manual page at: @UUID[.YVK313QA0zjBRca0]{Inventory}</p><p>You can also see @UUID[.yvcLeBP3ma2lNrxN]{Creating Weapons} for details about weapons/implements specifically.</p><h2 data-anchor=\"feats-(also-contains-features-and-rituals)\">Features (and Feats)</h2><p>This is where you can specify feats and the features you get from your class, race, and so forth.</p><ul><li><p>Clicking on a feature's icon on the sheet will output its description to chat (which counts as \"item use\" for the purpose of macros).</p></li><li><p>Clicking the name will expand the feature's description</p></li><li><p>Use the button to edit or delete the feature</p></li></ul><h3>Configuring Features</h3><ul><li><p><strong>Details Tab: </strong>Unlike Gear, Features exist primarily for reference purposes; there are no mechanical effects to configure in the details tab. However, there are several fields provided to help with sorting and display.</p><ul><li><p><strong>Feature Type:</strong> This field allows you to differentate between feats, class features, racial traits, background benefits, monster traits, and so forth. All types are treated the same mechanically, but the groupings on the Feats tab are based on this field.</p></li><li><p><strong>Prerequisite</strong>: Mostly used in feats. This field is cosmetic; the system does <em>not</em> enforce prerequisites or alert you if you have illegal feats.</p></li><li><p><strong>Granted By:</strong> As the <code>Source</code> field is generally expected to contain a rulebook reference, this field is provided for features that should have a \"parent\" rule defined. For example, Steve's <em>Combat Weapon Talen</em>t <em>- One Handed</em> feature is granted by his <em>Fighter</em> class.</p></li><li><p><strong>Feature Group:</strong> Some features are part of a named group where you choose one of several options; for example, Steve's <em>Combat Weapon Talent - One Handed</em> feature is part of the <em>Fighter Weapon Talent</em> group. This can also be used for feats with a named subtype (<em>divin</em>e, <em>heritage</em> etc.) and to note which itme is a Race or Class rather than and individual Class/Race feature.</p></li><li><p><strong>Aura Size:</strong> Especially in the case of monster traits, many features are auras of a specific size. which is normally noted in their title display. For non-aura features, just leave this field blank.<br />(Note that this field does not <em>create</em> an aura effect; for that you will need to look into modules.)</p></li></ul></li><li><p><strong>Keywords Tabs:</strong> Features can have keywords just like powers, although nothing interacts with them by default. If you have checked a keyword for a feature, any active effect you create on that feature will have the same keyword added by default (though you can delete them if they are unneeded).</p></li><li><p><strong>Effects and Macros Tabs:</strong> If you want to add a mechanical effect to a feature, you can add an active effects though the Effects tab, or a macro through the Macros tab. The process is much the same as with powers, except that active effects lack the trigger and target information they would have when attached to a power; all effects on features are assumed to be permanent. However, they can be toggled on/off from the list in the character's Effects tab when necessary.</p></li></ul><h2>Rituals</h2><p>As well as their description, rituals have a details panel where you can specify the ritual mechanical details. If the ritual requires a roll check you can select it here. If you leave the formula box blank the roll will be 1d20 + the relevant ability/skill.</p><p>To track component costs automatically set the first dropdown in Resource Consumption to Attribute, and then you are looking for attributes starting with \"<code>ritualcomp.</code>\" which are usually at the bottom.</p><ul><li><p><strong>Example:</strong> <a class=\"content-link\" draggable=\"true\" data-pack=\"dnd4e.example_character\" data-uuid=\"Compendium.dnd4e.example_character.Actor.BF5aEE8y1e3bh7Jc\" data-id=\"BF5aEE8y1e3bh7Jc\">Steve</a> has a Homebrew ritual, <a class=\"content-link\" draggable=\"true\" data-pack=\"dnd4e.example_powers\" data-uuid=\"Compendium.dnd4e.example_powers.Item.Nr5yUBr0Rzd5EuxY\" data-id=\"Nr5yUBr0Rzd5EuxY\">Summon Badgers</a>, which demonstrates this.</p></li></ul>",
        "markdown": ""
      },
      "video": {
        "controls": true,
        "volume": 0.5
      },
      "src": null,
      "system": {},
      "ownership": {
        "default": -1
      },
      "flags": {},
      "_stats": {
        "systemId": "dnd4e",
        "systemVersion": "0.4.24",
        "coreVersion": "13.351",
        "createdTime": 1688154337728,
        "modifiedTime": 1771992714189,
        "lastModifiedBy": "dnd4ebuilder0000",
        "duplicateSource": null,
        "exportSource": null
      },
      "category": null,
      "_key": "!journal.pages!PuJCVdkeDHbyFpeT.eGf9NelTL4ZKA7yE"
    },
    {
      "sort": 500000,
      "name": "Effects, Resistances and Weaknesses",
      "type": "text",
      "_id": "VVV9u8xffI9RvD9I",
      "title": {
        "show": true,
        "level": 2
      },
      "image": {},
      "text": {
        "format": 1,
        "content": "<img style=\"max-width:100%;height:auto\" src=\"systems/dnd4e/icons/manual-images/effects.jpg\" width=\"769\" height=\"407\" /><p>Attack modifier and Damage modifier are global bonuses to attack and damage that you can reference using <code>@atkMod</code> and <code>@damMod</code> in powers.</p><p>Click on \"Bonus\" to set bonuses to those values.</p><h3>Resistances and Weaknesses</h3><p>This lets you track your various damage resistances, which are automatically applied if you use the \"Apply Damage\" feature in chat.</p><p>The values are from the point of view of a resistance, so a positive value resists damage, a negative value means a vulnerability to damage.</p><p>\"Physical\" represents untyped weapon damage (the 4E rules do not specify it explicitly, but reference it as \"weapon damage\" any time it is relevant).</p><p>\"<code>Damage</code>\" represents all damage types. So a resistance to \"<code>Damage</code>\" will apply to every type.</p><p>Clicking on \"Bonus\" lets you specify a bonus to that type of damage, and the checkbox lets you specify immune to that damage type.</p><p>Resistances can also be granted by effects.</p><ul><li><strong>Example:</strong> @UUID[Compendium.dnd4e.featuresPack.Item.NAIdYGuARc0asb9g]{Tiefling} is used on @UUID[Compendium.dnd4e.example_character.Actor.iK3UnA8rC1xbJ1Ap]{Steve} and shows how to add the tiefling's fire resistance.</li></ul>",
        "markdown": ""
      },
      "video": {
        "controls": true,
        "volume": 0.5
      },
      "src": null,
      "system": {},
      "ownership": {
        "default": -1
      },
      "flags": {},
      "_stats": {
        "systemId": "dnd4e",
        "systemVersion": "0.4.24",
        "coreVersion": "13.351",
        "createdTime": 1688154368784,
        "modifiedTime": 1771991063823,
        "lastModifiedBy": "dnd4ebuilder0000",
        "duplicateSource": null,
        "exportSource": null
      },
      "category": null,
      "_key": "!journal.pages!PuJCVdkeDHbyFpeT.VVV9u8xffI9RvD9I"
    },
    {
      "sort": 450000,
      "name": "Inventory",
      "type": "text",
      "_id": "YVK313QA0zjBRca0",
      "title": {
        "show": true,
        "level": 2
      },
      "image": {},
      "text": {
        "format": 1,
        "content": "<p>Your Inventory tab contains subsections for the various weapons and implements, slot-based equipment, magical trinkets, single-use items, and whatever other miscellaneous junk an adventurer might squirrel away. Note that the sections here don't map perfectly onto 4e's item categories, as they are based specifically on mechanical implementation.</p><p>Aside from the very top section, which tracks currencies, each subsection has a common set of controls:</p><ul><li><p><strong>Icon:</strong> Click a item's icon to \"use\" it. This sends its power card to chat, and—if the item has an activated effect—also triggers the relevant roll or dialogue.</p></li><li><p><strong>Name:</strong> Click on an item's name to expand/collapse its details.</p></li><li><p><strong>Buttons:</strong> Use the edit and delete buttons at the end of the row to manage existing items. You can also click the button with a <strong>shield icon</strong> to toggle whether an item is currently equipped. (This is available for all items, although it can safely be ignored for things like consumables.)</p></li></ul><h3>Currency</h3><p>Currency and Ritual components track your various currencies and can be accessed as character sheet attributes. This lets you tie ritual casting to the relevant component.</p><h3>Weapons</h3><p>Lists the weapons and implements carried by the character.</p><p>Creating weapons is detailed enough to warrant its own manual page: @UUID[.yvcLeBP3ma2lNrxN]{Creating Weapons}</p><h3>Equipment</h3><img style=\"max-width:100%;height:auto\" src=\"systems/dnd4e/icons/manual-images/equipment.jpg\" width=\"669\" height=\"579\" /><p>For the purposes of Foundry, equipment is any gear aside from weapons and implements which is worn or equipped in order to gain its effect, usually in a specific body slot. Equipment has some specific fields on its detail tab for entering the most common bonuses—such as to defences and resistances—and for the drawbacks typically associated with armour and shields.</p><p>Equipment only gives its benefit if it is set to <em>equipped</em> and <em>proficient</em>. <strong>If armour is not set as proficient, it will apply a -2 attack penalty. If a shield is not set as proficient it will not apply a defence bonus.</strong></p><p>When assigning armour penalties to skills and movement speed, it does not matter if you specify a positive or negative value, it will be applied as a penalty.</p><p>If the equipment gives damage resistance, you can add it on here by clicking the + icon. Specify the value (positive for resistance, negative for vulnerability) and select the damage type from the dropdown.</p><h4>Equipment and Item Powers</h4><p>Unfortunately, Equipment items cannot contain activated powers. If you have a piece of equipment that uses <strong>a specific slot </strong><em><strong>and</strong></em><strong> has an activated power</strong>, you will need to create a separate Power with the \"Item\" type, and add both to the character.</p><p>However, if you have a Wondrous Item (ie, slotless) with an activated power, you can avoid having to create a separate power if you create it as a rechargeable Consumable (see below) instead.</p><p>A Wondrous Item with only a static benefit (such as you would create with an Active Effect) is probably best modelled by an Equipment item that uses \"Other\" for its slot.</p><h3>Consumables</h3><p>This category contains everything from food, to ammo, to potions and alchemical items. Consumables differ from most other inventory in that they have activation effects—they can roll like a power.</p><p>As the name implies, these are typically items that are consumed or destroyed when used, like potions. However, since the item can also be rechargeable, this can also be a good way to model wondrous items with a single activated power.</p><p>If you click a consumable's icon in the table, you will get a consumption dialog before the relevant chat messages are output and resources consumed.</p><h4>Consumable Usage</h4><img style=\"max-width:100%;height:auto\" src=\"systems/dnd4e/icons/manual-images/consumable-use.jpg\" width=\"579\" height=\"121\" /><p>Probably the most important section, this determines how a consumable gets used up. The most common setting is for charges—ie, each consumable has a number of charges that once they are gone, are gone. When you run out of charges, one of that consumable is used up and the number you have is decreased.</p><p>This means the most common setting is 1/1 charges, with \"destroy on empty\" checked. In this case, 1 consumable is used and gone forever on each activation.</p><p>You can also set <strong>Resource Consumption</strong> for items that use an additional resource upon activation. For example, healing potions usually burn a healing surge.</p><ul><li><p><strong>Example:</strong> @UUID[Compendium.dnd4e.example_character.Actor.BF5aEE8y1e3bh7Jc.Item.umRuMzu4UZsPmzED]{Potion of Minor Healing} on @Compendium[dnd4e.example_character.BF5aEE8y1e3bh7Jc]{Steve} shows this in practice.</p></li></ul><p>For most <strong>ammunition</strong>, The Consumable Usage section is all you need to concern yourself with; you don't generally activate ammunition by itself, but rather you specify it as the resource consumed by your bow.</p><ul><li><p><strong>Example:</strong> See the Shortbow on @Compendium[dnd4e.example_character.BF5aEE8y1e3bh7Jc]{Steve} for an example of using ammunition.</p></li></ul><h4>Consumable Activation</h4><p>Consumables can also roll like a power when activated. For these, you can use the checkboxes to select what kind of roll is required—attack, damage, healing or other. These all function the same as the matching roll types in a Power, so will not be covered here.</p><ul><li><p><strong>Example:</strong> @UUID[Compendium.dnd4e.equipmentPack.Item.0ddspnljambxzwyO]{Alchemical Fire Bomb (lvl 1)} is a consumable that makes an attack and damage roll.</p></li></ul><p>To make a reusable wondrous item with an activated power (commonly nicknamed a \"trinket\"), you can set up your Consumable Activation as necessary, and combine it with the following Consumable Usage settings:</p><ul><li><p>Uncheck \"destroy on empty\"</p></li><li><p>Select \"round\"/\"day\"/\"encounter\" from the dropdown instead of instead of \"charges\"</p></li></ul><p>With this configuration, using the consumable will deplete but not destroy it. Its allocated uses will then be restored after an appropriate cooldown.</p><h3>Tools</h3><p>Tools are designed to work with skills or abilities, and the details tab lets you specify which one you would like.</p><p>The function of a tool is simply to roll a skill or ability check with the specified bonus. This is useful for creating items that give a skill bonus specifically when applied to a check—for example, a climber's kit—rather than giving a permanent bonus.</p><h3>Loot</h3><p>Loot is the catch-all for items that do not have any mechanical effects, and are description only.</p><h3>Containers</h3><p>Containers can have their own list of items that are stored inside, and won't appear on your main inventory list. To edit the contents of a container, open its item sheet with \"edit\".</p><p>If you delete a container from your character sheet, its contents will be added to your main inventory rather than being deleted.</p><h3>System Provided Templates</h3><h4>SRD ...</h4><p>The SRD Weapons, SRD Armour and SRD Equipment are direct copies of the tables in the PHB, as per the SRD. Grabbing the base weapon from here is an ideal way to start making a magic item.</p><h4>Example ...</h4><p>Example Alchemical Items, Potions and Poisons contain items with the mechanical effects of items published in the SRD. However, they do not use the same names, descriptions or flavour text, as the SRD does not permit these parts to be reproduced verbatim. If you have your rulebooks on hand, it should be easy to see which example items correspond with which published items.</p>",
        "markdown": ""
      },
      "video": {
        "controls": true,
        "volume": 0.5
      },
      "src": null,
      "system": {},
      "ownership": {
        "default": -1
      },
      "flags": {},
      "_stats": {
        "systemId": "dnd4e",
        "systemVersion": "0.4.24",
        "coreVersion": "13.351",
        "createdTime": 1688155482792,
        "modifiedTime": 1771991047886,
        "lastModifiedBy": "dnd4ebuilder0000",
        "duplicateSource": null,
        "exportSource": null
      },
      "category": null,
      "_key": "!journal.pages!PuJCVdkeDHbyFpeT.YVK313QA0zjBRca0"
    },
    {
      "name": "Creating Weapons",
      "type": "text",
      "title": {
        "show": true,
        "level": 1
      },
      "text": {
        "format": 1,
        "content": "<p>When modelling implements in 4E, model them as weapons. Foundry supports weapon, implements and weapons that are also implements.</p><p>@UUID[Compendium.dnd4e.example_character.Actor.iK3UnA8rC1xbJ1Ap]{Steve} has several weapons to see as examples; his Longsword is a +1 magic item, and his bow automatically uses +1 arrows.</p><h2>Weapon Details</h2><img style=\"max-width:100%;height:auto\" src=\"systems/dnd4e/icons/manual-images/weapon-details.jpg\" width=\"568\" height=\"143\" /><p>These options are mostly used for powers selecting an appropriate weapon.</p><p>A <strong>Weapon Type</strong> of \"Implement\" will set the implement property in properties (below)</p><p>For <strong>Weapon Hand</strong> select the hand(s) you are using the weapon in.</p><p>For the <strong>Weapon Status</strong>, select how you are proficient—either as a weapon or as an implement or both. These are checked by some of the attack formula.</p><h2>Weapon Stats</h2><img style=\"max-width:100%;height:auto\" src=\"systems/dnd4e/icons/manual-images/weapon-stats.jpg\" width=\"567\" height=\"354\" /><p><strong>Proficiency Bonus:</strong> A weapon's proficiency bonus. Referred to in formula as <code>@profbonus</code></p><p><strong>Implement Proficiency Bonus:</strong> (Only shown if the weapon has the implement property) Enter a separate proficiency bonus for when this is used as an implement, if required. Most implements do not have a proficiency bonus, though it is a good place to put the bonus for the Accurate Wand. Referred to in formula as <code>@profImpBonus</code></p><p><strong>Enhancement Bonus: </strong>The weapon's magical enhancement bonus; can be referred to using <code>@enhance</code>. You can also use <code>@enhanceImp</code>, which only returns the value if \"Implement Proficient\" has been ticked. Otherwise, it will be 0.</p><p><strong>Limited Uses:</strong> Can generally be left blank, there are very few weapons that have limited uses</p><p><strong>Resource Consumption: </strong>Mostly for ranged weapons. Select your ammunition here and it will be automatically consumed (and add bonuses if applicable) when the weapon is used.</p><p><strong>Weapon Damage Dice:</strong> These form the core weapon damage (referred to as \"[W]\" in power text). They are not referenced by a variable, but have their own dropdown when creating Powers.</p><p><strong>Extra Modifiers:</strong> These will be inserted into the Foundry dice roll expression directly after the weapon dice, so you can modify the dice roll using Foundry's additional dice commands.</p><p>It is very rare that you will ever want to do this, so it's almost always best to leave this blank. (You might use it for something like the Brutal property, except that Brutal is common enough to have its own setting below).</p><p><strong>Brutal Dice Value:</strong> (Only appears if the brutal property has been selected) Enter the brutal value of the weapon. If left blank this defaults to 1, as most brutal weapons are Brutal 1.</p><p><strong>Critical Hit:</strong> The number that must be rolled on the attack roll to get a critical hit. Usually 20.</p><p><strong>Implement Critical Hit:</strong> The number that must be rolled on the attack roll of an implement attack with this weapon to get a critical hit. Usually 20.</p><h2>Weapon Formula</h2><p>@UUID[.UteMJPMuW11OAKWl]{Possible Variables in Formula} Lists all the possible variables you can use in formula, and what they do.</p><img style=\"max-width:100%;height:auto\" src=\"systems/dnd4e/icons/manual-images/weapon-damage.jpg\" width=\"567\" height=\"510\" /><p><strong>Bonus to Attack Formula:</strong> This is what goes into <code>@wepAttack</code> in power formula. The default (proficiency bonus + enhancement bonus) is correct for most cases.</p><p><strong>Bonus to Primary Damage Formula:</strong> This is what goes into <code>@wepDamage</code> in power formula. The default (enhancement bonus) is correct for most cases.</p><p><strong>Secondary Damage Formula:</strong> If the weapon always does some form of secondary damage on hit (e.g. 1d6 fire damage), you can enter it in a line here. It will be automatically added to damage when you hit.</p><p><strong>Bonus to Critical Damage Formula: </strong>This is what goes into <code>@wepCritBonus</code> in power formula—the bonus damage you get on a critical. This defaults to 1d6 per level of magical enhancement which is correct for most weapons. Weapons with the High Crit property, or certain magical weapons (normally \"Brutal\" ones, not to be confused with the Brutal weapon property) will want to tweak this.</p><p><strong>Secondary Critical Damage Formula:</strong> This will be used instead of secondary damage formula on a crit (so from our above fire example, would just be 6 assuming that the secondary damage was also maximised on crit).</p><h2>Weapon Properties</h2><img style=\"max-width:100%;height:auto\" src=\"systems/dnd4e/icons/manual-images/weapon-properties.jpg\" width=\"471\" height=\"467\" /><p>Here you check relevant damage types, properties and groups. Most of these are just used as markers for certain conditional effects.</p><p><strong>Implement:</strong> Enables the implement input boxes above and the implement group below.</p><p><strong>Brutal:</strong> Enables the brutal range box.</p><p><strong>Versatile:</strong> If wielded in 2 hands, applies additional damage.</p><h2>Creating Magic Weapons</h2><p>The easiest way is to take a base weapon, give it a nice new name, set the enhancement bonus and price as appropriate. If the magic weapon also has an activated power attached, you will need to make a separate Item Power and add that to your character as well.</p>",
        "markdown": ""
      },
      "_id": "yvcLeBP3ma2lNrxN",
      "image": {},
      "video": {
        "controls": true,
        "volume": 0.5
      },
      "src": null,
      "system": {},
      "sort": 500000,
      "ownership": {
        "default": -1
      },
      "flags": {},
      "_stats": {
        "systemId": "dnd4e",
        "systemVersion": "0.4.24",
        "coreVersion": "13.351",
        "createdTime": 1688155662512,
        "modifiedTime": 1771991082225,
        "lastModifiedBy": "dnd4ebuilder0000",
        "duplicateSource": null,
        "exportSource": null
      },
      "category": null,
      "_key": "!journal.pages!PuJCVdkeDHbyFpeT.yvcLeBP3ma2lNrxN"
    },
    {
      "name": "Creating Powers",
      "type": "text",
      "title": {
        "show": true,
        "level": 1
      },
      "text": {
        "format": 1,
        "content": "<p>The sheet attempts to set as many sensible defaults as possible for powers. If created the power from a specific group header, the defaults will try to adapt to that group (for example, setting the action type or usage appropriately).</p><ul><li><p><strong>Example:</strong> As always, @UUID[Compendium.dnd4e.example_character.Actor.iK3UnA8rC1xbJ1Ap]{Steve, The Example Character} has a good selection of example Powers. Advanced users may want to check out his \"Twin Strike (Primary)\" power, which uses a macro to automatically roll the \"Twin Strike (Off Hand)\" power as a secondary attack.</p></li></ul><p>@UUID[.UteMJPMuW11OAKWl]{Possible Variables in Formula} Lists all the possible variables you can use in power formulae, and what they do.</p><h2>Power Details</h2><img style=\"max-width:100%;height:auto\" src=\"systems/dnd4e/icons/manual-images/power-details.jpg\" width=\"568\" height=\"502\" /><p>Most of these should be familiar from the 4E power card.</p><p><strong>Auto Generate Power Card Details:</strong> If this is checked, then when output to the chat all of the various details will be output, like a power card. If unchecked only the description will be output.</p><p><strong>Weapon Required: </strong>These determine if a weapon is to be used with the power.</p><p>We will refer to the left hand dropdown (\"Melee Weapon\" in the image) as \"<strong>Weapon Type</strong>\" and the right hand dropdown as \"<strong>Weapon Use</strong>\".</p><p><strong>Weapon Type:</strong> determines the type of weapon the power requires.</p><ul><li>Melee</li><li>Ranged</li><li>Melee or Ranged</li><li>Implement</li><li>None</li><li>Any</li></ul><p>If the type is set to <code>Melee</code>, <code>Ranged</code>, <code>Either</code> or <code>Any</code>, then the character must have a weapon equipped to use with the power in order to make the attack roll. If this is set to any weapon option or to <code>Implement</code>, it will also set the <code>Weapon</code> or <code>Implement</code> keyword on the power.</p><p><strong>Weapon Use:</strong> determines which weapon is to be used to satisfy the Weapon Type requirement.</p><ul><li><code>Default</code>: Find the First Matching Weapon</li><li><code>Default Off Hand</code>: Find the first matching weapon where the \"Weapon Hand\" field is set to \"Off Hand\"</li><li><code>None</code>: Do not enforce a weapon being equipped (this is primarily used for monsters, who have \"Weapon\" powers, but have set attack and damage stats that are not reliant on a piece of equipment)</li><li><code>[Weapon Name]</code>: The list of weapons in the characters inventory for you to select a specific weapon. It is generally recommended to pick this option so you know what you are rolling.</li></ul><p><strong>Power's Range:</strong> If you set an area or close range, you will get an option to place a template of the right size.</p><p><strong>Limited Uses:</strong> For encounter or daily powers, set this as appropriate and the sheet will flag if you try to use it again. Short rest and extended rest will refresh these powers as appropriate.</p><p><strong>Recharge On Condition:</strong> Primarily for Monster recharge powers. If the recharge is based on some non-dice condition (e.g. \"when first bloodied\") enter it here. If you click to roll a used recharge power with only recharge on condition set, then the sheet will assume the condition has been met, and will re-enable the power with a chat message.</p><p><strong>Recharge on Roll:</strong> Primarily for Monster recharge powers. If the recharge is based on a d6 roll, enter the minimum number required for a recharge here (e.g. for 5-6, enter 5). If you click to roll a used recharge power with a recharge roll set, then a roll will be made for you in chat, and the power re-enabled if it recharges.</p><p><strong>Resource Consumption:</strong> If the power directly consumes resources. If you have set the power to use a ranged weapon with uses ammunition, do not add the ammunition consumption here too (or you will double charge your ammo!)</p><h2>Attack Details</h2><img style=\"max-width:100%;height:auto\" src=\"systems/dnd4e/icons/manual-images/power-attack.jpg\" width=\"570\" height=\"536\" /><p><strong>Attack Formula:</strong> This is a sensible default that works for most powers. If you are not using a weapon then <code>@wepAttack</code> will be automatically set to 0. If Weapon Type is set to \"implement\" then <code>@wepAttack</code> will automatically read the \"Implement Damage Formula\" from the weapon instead of the \"Weapon Damage Formula\"</p><p><code>@atkMod</code> here is the global attack modifer specified in the \"effects\" tab of the character sheet.</p><p><strong>Base Damage:</strong></p><ul><li>Base Weapon Damage: The \"Weapon Damage Dice\" of the selected weapon. The first input box becomes a multiplier. e.g. \"3[W]\"</li><li>Flat Damage: The first input box is the amount of damage</li><li>Dice: The first input box is the number of dice.</li></ul><p><strong>Damage Formula:</strong> This is a sensible default for many powers. <code>@powBase</code> refers to the \"Base Damage\" field above.</p><p><code>@wepDamage</code> is \"Bonus to Primary Damage Formula\" on the selected weapon, \"Implement Attack Formula\" if the Weapon Type is implement, or 0 if it is a no-weapon power.</p><p><code>@dmgMod</code> is the global damage modifier specified in the \"effects\" tab of the character sheet.</p><p><strong>Secondary Damage Formula:</strong>If the power always does some form of secondary damage on hit (e.g. 1d6 fire damage), you can enter it in a line here. It will be automatically added to damage when you hit.</p><p><strong>Critical Damage Formula:</strong> <code>@powMax</code> is the maximum value posible from \"Base Damage\".</p><p><strong>Secondary Critical Damage Formula:</strong> This will be used instead of secondary damage formula on a crit (so from our above fire example, would just be 6 assuming that the secondary damage was also maximised on crit.</p><p><span><strong>Miss Damage Formula:</strong> Entering anything here will cause an additional damage roll button to be shown for a miss. If the miss is \"half damage\" you can leave this blank, and use the damage application buttons on the chat card to apply half damage. (See @UUID[Compendium.dnd4e.manual.JournalEntry.SzCSgM25qVHZ05UW]{Attacks and Rolls}).</span></p><p><strong>Primary Damage Type:</strong> Will be used to compare against resistances if using the damage application buttons. For untyped/wepaon damage, use \"Physical\".</p><h2>Effect Details</h2><img style=\"max-width:100%;height:auto\" src=\"systems/dnd4e/icons/manual-images/power-effects.jpg\" width=\"570\" height=\"626\" /><p>These are text fields that appear on the power card in chat, and correspond to the fields on a 4E power card. Here you can describe your damage formula in words, and put that \"half damage\" on a miss, so you know to apply it.</p><p><strong>Effect Details:</strong> You can toggle to a rich text editor for complex effects, which will take up a lot of vertical room and punt the rest down. After you are done you can toggle the rich text editor off again, and it will save your formatting. (You can also enter HTML directly if you know how to use it—just don't blame us for any resulting weirdness!)</p><p><strong>Effect Types and Keywords:</strong> These are used for certain conditional effects, as well as appearing in the relevant place on the power card.</p>",
        "markdown": ""
      },
      "_id": "mVgzXSGDBKE0gtBt",
      "image": {},
      "video": {
        "controls": true,
        "volume": 0.5
      },
      "src": null,
      "system": {},
      "sort": 500000,
      "ownership": {
        "default": -1
      },
      "flags": {},
      "_stats": {
        "systemId": "dnd4e",
        "systemVersion": "0.4.24",
        "coreVersion": "13.348",
        "createdTime": 1688155671244,
        "modifiedTime": 1733179437841,
        "lastModifiedBy": "dnd4ebuilder0000",
        "duplicateSource": null,
        "exportSource": null
      },
      "category": null,
      "_key": "!journal.pages!PuJCVdkeDHbyFpeT.mVgzXSGDBKE0gtBt"
    },
    {
      "name": "Possible Variables in Formulae",
      "type": "text",
      "title": {
        "show": false,
        "level": 1
      },
      "text": {
        "format": 1,
        "content": "<p>The following values can be used in various rolls. Most are applicable to the various formula fields in powers and apply based on the power itself, or refer to the weapon that the power is using.</p><p>Those related directly to an actor can also be used in effects.</p><table><caption>Actor Variables</caption><thead><tr><th style=\"max-width:20%\">Variable</th><th>What is it?</th></tr></thead><tbody><tr><td><code>@powerMod</code></td><td>The modifier of the selected attribute for a power (on valid in Power rolls).</td></tr><tr><td><code>@attribute</code></td><td>The check modifier for the selected attribute or skill in a tool or ritual roll. (Only valid in tool and ritual rolls)</td></tr><tr><td><code>@strMod</code></td><td>Actor's strength modifier</td></tr><tr><td><code>@dexMod</code></td><td>Actor's dexterity modifier</td></tr><tr><td><code>@intMod</code></td><td>Actor's intelligence modifier</td></tr><tr><td><code>@wisMod</code></td><td>Actor's wisdom modifier</td></tr><tr><td><code>@chaMod</code></td><td>Actor's charisma modifier</td></tr><tr><td><code>@lv</code></td><td>Actor's level</td></tr><tr><td><code>@lvhalf</code></td><td>Actor's level/2</td></tr><tr><td><code>@tier</code></td><td>Actor's tier expressed as a number (heroic = 1, paragon = 2, epic = 3)</td></tr><tr><td><code>@heroic</code></td><td>1 if the actor is in the heroic tier, 0 otherwise.</td></tr><tr><td><code>@paragon</code></td><td>1 if the actor is in the paragon tier, 0 otherwise.</td></tr><tr><td><code>@epic</code></td><td>1 if the actor is in the epic tier, 0 otherwise.</td></tr><tr><td><code>@heroicOrParagon</code></td><td>1 if the actor is in the heroic tier or paragon tier (e.g. level &lt;21), 0 otherwise.</td></tr><tr><td><code>@paragonOrEpic</code></td><td>1 if the character is in the paragon or epic tiers (e.g. level &gt; 10), 0 otherwise</td></tr><tr><td><code>@bloodied</code></td><td>1 if the character's current hit points are at or below half of their total hit points, 0 otherwise</td></tr><tr><td><code>@scale</code></td><td><p>The common scale of 1 per five character levels.<br />To start the scale at a level higher than 1, add a number value to the end. (eg. <code>@scale4</code> returns 1 at level 4, 2 at level 9, etc)</p></td></tr><tr><td><code>@sneak</code></td><td>The unique tier-based scale used for sneak attack dice (since it's so difficult to formulate manually).</td></tr><tr><td><code>@enhArmour</code></td><td><p>Actor's current enhancement bonus to AC. Useful to scale something based on magic armour.<br />(Will check inherent enhancement bonuses if those are enabled, not just items.)</p></td></tr><tr><td><code>@enhNAD</code></td><td><p>Actor's current enhancement bonus to Non-AC Defences. Useful to scale something based on a magical neck item.<br />(The bonus should always be the same for all NADs, but if it isn't for some reason, the lowest value will be used.)<br />(Will check inherent enhancement bonuses if those are enabled, not just items)</p></td></tr><tr><td><code>@atkMod</code></td><td>Actor's global attack modifier, specified in the Modifiers section at the top of the Effects tab.</td></tr><tr><td><code>@dmgMod</code></td><td>Actor's global damage modifier, specified in the Modifiers section at the top of the Effects tab.</td></tr><tr><td><code>@charaID</code></td><td>The actor's ID (the unique string generated by Foundry)</td></tr><tr><td><code>@charaUID</code></td><td>The actor's Universally Unique Identifier (string including actor ID plus scene/token ID)</td></tr><tr><td><code>@attr.attr.attr</code></td><td><p>Any attribute in the Actor’s inner data object, referenced from that object as root. (i.e. referenced from <code>actor.system</code>, so the actors' current hp could be referenced as <code>@attributes.hp.value</code>).<br />Recommended only for power users</p></td></tr></tbody></table><table><caption>Power/Weapon Variables</caption><thead><tr><th style=\"max-width:20%\">Variable</th><th>What is it?</th></tr></thead><tbody><tr><td><code>@powerMod</code></td><td>The ability modifier of whatever ability has been selected in the Attack dropdown.</td></tr><tr><td><code>@wepAttack</code></td><td><p>If the power's “Weapon Required” field is set to Implement: the “Implement Attack Formula” entry of the Weapon.<br />If the power's “Weapon Required” field is set to anything else: the “Bonus to Attack Formula” entry of the Weapon.</p></td></tr><tr><td><code>@wepDamage</code></td><td><p>If the power's “Weapon Required” field is set to Implement: the “Bonus to Implement Damage Formula” entry of the Weapon.<br />If the power's “Weapon Required” field is set to anything else: the “Bonus to Primary Damage Formula” entry of the Weapon</p></td></tr><tr><td><code>@wepCritBonus</code></td><td><p>If the power's “Weapon Required” field is set to Implement: the “Bonus to Implement Critical Damage Formula” entry of the Weapon<br />If the power's “Weapon Required” field is set to anything else: the “Bonus to Critical Damage Formula” entry of the Weapon.</p></td></tr><tr><td><code>@impAttackO</code></td><td>“Implement Attack Formula” entry in a Weapon</td></tr><tr><td><code>@impDamageO</code></td><td>“Bonus to Implement Damage Formula” entry in a Weapon</td></tr><tr><td><code>@impAttack</code></td><td>If the user is proficient in the implement (“Implement Proficient” checkbox in the Weapon Details section of the weapon) then “Implement Attack Formula” entry in a Weapon, otherwise 0</td></tr><tr><td><code>@impDamage</code></td><td>If the user is proficient in the implement (“Implement Proficient” checkbox in the Weapon Details section of the weapon) then “Bonus to Implement Damage Formula” entry in a Weapon, otherwise 0</td></tr><tr><td><code>@impCritBonus</code></td><td>The weapon's “Bonus to Implement Critical Damage Formula”</td></tr><tr><td><code>@profBonusO</code></td><td>The weapon's “Proficiency Bonus”</td></tr><tr><td><code>@profImpBonusO</code></td><td>The weapon's “Implement Proficiency Bonus”</td></tr><tr><td><code>@profImpBonus</code></td><td>If the user is proficient in the implement (“Implement Proficient” checkbox in the Weapon Details section of the weapon) then the weapon's “Implement Proficiency Bonus”, otherwise 0</td></tr><tr><td><code>@profBonus</code></td><td>If the user is proficient in the weapon (“Weapon Proficient” checkbox in the Weapon Details section of the weapon) then the weapon's “Proficiency Bonus”, otherwise 0</td></tr><tr><td><code>@enhanceImp</code></td><td>If the user is proficient in the implement (“Implement Proficient” checkbox in the Weapon Details section of the weapon) then the weapon's “Enhancement Bonus”, otherwise 0</td></tr><tr><td><code>@enhance</code></td><td>The weapon's “Enhancement Bonus”</td></tr><tr><td><code>@powBase</code></td><td>The “Base Damage” specified by a power. (May be a multiplier around @wepDamage)</td></tr><tr><td><code>@wepMax</code></td><td>A value for if a weapon's “Damage Dice” entry had rolled maximum.</td></tr><tr><td><code>@powMax</code></td><td>A value for if a powers “Base Damage” entry had rolled maximum</td></tr><tr><td><code>@damageFormula</code></td><td><p>Only valid in Miss Damage formula. The entire primary damage of the power.<br />(Mostly redundant as you can easily apply half damage by clicking on the damage output and selecting half damage from the resulting menu)</p></td></tr><tr><td><code>@halfDamageFormula</code></td><td><p>Only valid in Miss Damage formula. The entire primary damage of the power divided by 2.<br />(Mostly redundant as you can easily apply half damage by clicking on the damage output and selecting half damage from the resulting menu)</p></td></tr></tbody></table><h2>Custom Variables</h2><p>It is possible to create a custom <code>@variable</code> that can be referenced in attack and damage rolls, other roll formula and effects. To do this, create an effect with a modifier whose key begins with @, e.g. <code>@MyCoolBonus</code>. (Note, if you're using autocomplete for inline properties you will need to close the autocomplete dialog.)</p><p>Once the effect is created, you can reference <code>@MyCoolBonus</code> in powers and in active effects (see @UUID[Compendium.dnd4e.manual.JournalEntry.VLRhDKYMBtS0MrJa]{Effects}).</p>",
        "markdown": ""
      },
      "_id": "UteMJPMuW11OAKWl",
      "image": {},
      "video": {
        "controls": true,
        "volume": 0.5
      },
      "src": null,
      "system": {},
      "sort": 500000,
      "ownership": {
        "default": -1
      },
      "flags": {},
      "_stats": {
        "systemId": "dnd4e",
        "systemVersion": "0.4.24",
        "coreVersion": "13.348",
        "createdTime": 1688156856202,
        "modifiedTime": 1757295265422,
        "lastModifiedBy": "dnd4ebuilder0000",
        "duplicateSource": null,
        "exportSource": null
      },
      "category": null,
      "_key": "!journal.pages!PuJCVdkeDHbyFpeT.UteMJPMuW11OAKWl"
    }
  ],
  "ownership": {
    "default": 0
  },
  "_stats": {
    "systemId": "dnd4e",
    "systemVersion": "0.4.24",
    "coreVersion": "13.348",
    "createdTime": 1688154171505,
    "modifiedTime": 1695613037229,
    "lastModifiedBy": "dnd4ebuilder0000",
    "duplicateSource": null,
    "exportSource": null
  },
  "_id": "PuJCVdkeDHbyFpeT",
  "sort": 0,
  "categories": [],
  "_key": "!journal!PuJCVdkeDHbyFpeT"
}
